thesis/listings/streaming-message-output.xml

<soap:Envelope
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:wsa="http://www.w3.org/2005/08/addressing"
    xmlns:stream="https://github.com/autermann/streaming-wps"
    xmlns:ows="http://www.opengis.net/ows/1.1"
    xmlns:wps="http://www.opengis.net/wps/1.0.0">
  <soap:Header>
    <wsa:MessageID>uuid:ef9676f0-13b1-473b-a783-8fed8cbd6513</wsa:MessageID>
    <wsa:RelatesTo>uuid:6a0e50c7-85c4-448c-962d-894c41c441bf</wsa:RelatesTo>
    <wsa:Action>https://github.com/autermann/streaming-wps/output</wsa:Action>
  </soap:Header>
  <soap:Body>
    <stream:OutputMessage>
      <stream:ProcessID>uuid:c99e6f21-f0a0-4770-9615-db3501490f0a</stream:ProcessID>
      <stream:Outputs>
        <stream:Output>
          <ows:Identifier>output1</ows:Identifier>
          <wps:Data>
            <wps:LiteralData dataType="xs:string">input1</wps:LiteralData>
          </wps:Data>
        </stream:Output>
        <stream:Output>
          <ows:Identifier>output2</ows:Identifier>
          <wps:Data>
            <wps:ComplexData mimeType="application/xml" encoding="UTF-8">
              <hello>world</hello>
            </wps:ComplexData>
          </wps:Data>
        </stream:Output>
        <stream:Output>
          <ows:Identifier>output3</ows:Identifier>
          <wps:Data>
            <wps:BoundingBoxData crs="EPSG:4326" dimensions="2">
              <ows:LowerCorner>52.2 7.0</ows:LowerCorner>
              <ows:UpperCorner>55.2 15.0</ows:UpperCorner>
            </wps:BoundingBoxData>
          </wps:Data>
        </stream:Output>
      </stream:Outputs>
    </stream:OutputMessage>
  </soap:Body>
</soap:Envelope>